Repository: nvdaaddons/BMI
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, fr

source: &Calculate your BMI...
es: &Calcular tu IMC...
fr: &Calculez votre IMC...

source: BMI, This add-on calculates the body mass index.
es: IMC, Este complemento calcula el índice de masa corporal.
fr: IMC, cette extension calcule l'indice de masse corporelle.

source: Calculation of the Body mass Index.
es: Cálculo del índice de masa corporal.
fr: Calcul de l'indice de masse corporelle.

source: Enter or select your height in centimeters:
es: Introduce o selecciona tu altura en centímetros:
fr: Saisissez ou sélectionnez votre taille en centimètres :

source: Enter or select your weight in kilograms:
es: Introduce o selecciona tu peso en kilogramos:
fr: Saisissez ou sélectionnez votre poids en kilogrammes :

source: C&alculate
es: C&alcular
fr: C&alculer

source: C&lean
es: &Limpiar
fr: &Nettoyer

source: &Cancel
es: &Cancelar
fr: &Annuler

source: Atention
es: Atención
fr: Attention

source: Your BMI is {}. Your BMI indicates that you are underweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to gain weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
es: Tu IMC es {}. Tu IMC indica que te falta algo de peso. Es importante consultar a un doctor o nutricionista para evaluar tu salud e identificar formas de ganar peso de manera sana. Observación: Para una interpretación adecuada del IMC, se recomienda considerar otros factores como la composición del organismo, distribución de grasa, edad, género y salud general de la persona. Siempre es recomendable consultar a un sanitario profesional, como un nutricionista o un fisioterapeuta, para una evaluación más precisa y consejos adecuados sobre salud y peso.
fr: Votre IMC est {}. Votre IMC indique que vous êtes obèse. Il est important de consulter un médecin ou un nutritionniste pour évaluer votre santé et identifier les moyens de perdre du poids de manière saine et de réduire les risques pour la santé. Remarque : Pour une interprétation adéquate de l'IMC, il est recommandé de considérer d'autres facteurs tels que la composition de l'organisme, la distribution de graisse, âge, sexe et état de santé général de la personne.\ Il est toujours conseillé de consulter un professionnel de la santé, comme un nutritionniste ou un physiothérapeute, pour un une évaluation plus précise et des conseils adaptés sur la santé et le poids.

source: Your BMI is {}. Your BMI indicates that you are at a healthy weight. Keep it up by maintaining a balanced diet and regularly engaging in physical activity. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
es: Tu IMC es {}. Tu IMC indica que tu peso es adecuado. Consérvalo manteniendo una dieta equilibrada y realizando actividad física de forma regular. Observación: Para una interpretación adecuada del IMC, se recomienda considerar otros factores como la composición del organismo, distribución de grasa, edad, género y salud general de la persona. Siempre es recomendable consultar a un sanitario profesional, como un nutricionista o un fisioterapeuta, para una evaluación más precisa y consejos adecuados sobre salud y peso.
fr: Votre IMC est {}. Votre IMC indique que votre poids est approprié. Maintenez-le en maintenant une alimentation équilibrée et en pratiquant une activité physique régulière. Remarque : Pour une interprétation adéquate de l'IMC, il est recommandé de considérer d'autres facteurs tels que la composition de l'organisme, la distribution de graisse, âge, sexe et état de santé général de la personne. Il est toujours conseillé de consulter un professionnel de la santé, comme un nutritionniste ou un physiothérapeute, pour un une évaluation plus précise et des conseils adaptés sur la santé et le poids.

source: Your BMI is {}. Your BMI indicates that you are overweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
es: Tu IMC es {}. Tu IMC indica que tienes sobrepeso. Es importante consultar a un doctor o nutricionista para evaluar tu salud e identificar formas de perder peso de manera sana. Observación: Para una interpretación adecuada del IMC, se recomienda considerar otros factores como la composición del organismo, distribución de grasa, edad, género y salud general de la persona. Siempre es recomendable consultar a un sanitario profesional, como un nutricionista o un fisioterapeuta, para una evaluación más precisa y consejos adecuados sobre salud y peso.
fr: Votre IMC est {}. Votre IMC indique que vous êtes en surpoids. Il est important de consulter un médecin ou un nutritionniste pour évaluer votre santé et identifier des moyens de perdre du poids de manière saine. Remarque : Pour une interprétation adéquate de l'IMC, il est recommandé de considérer d'autres facteurs tels que la composition de l'organisme, la distribution de graisse, âge, sexe et état de santé général de la personne. Il est toujours conseillé de consulter un professionnel de la santé, comme un nutritionniste ou un physiothérapeute, pour un une évaluation plus précise et des conseils adaptés sur la santé et le poids.

source: Your BMI is {}. Your BMI indicates that you are overweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
es: Tu IMC es {}. Tu IMC indica que tienes sobrepeso. Es importante consultar a un doctor o nutricionista para evaluar tu salud e identificar formas de perder peso de manera sana. Observación: Para una interpretación adecuada del IMC, se recomienda considerar otros factores como la composición del organismo, distribución de grasa, edad, género y salud general de la persona. Siempre es recomendable consultar a un sanitario profesional, como un nutricionista o un fisioterapeuta, para una evaluación más precisa y consejos adecuados sobre salud y peso.
fr: Votre IMC est {}. Votre IMC indique que vous êtes en surpoids. Il est important de consulter un médecin ou un nutritionniste pour évaluer votre santé et identifier des moyens de perdre du poids de manière saine. Remarque : Pour une interprétation adéquate de l'IMC, il est recommandé de considérer d'autres facteurs tels que la composition de l'organisme, la distribution de graisse, âge, sexe et état de santé général de la personne. Il est toujours conseillé de consulter un professionnel de la santé, comme un nutritionniste ou un physiothérapeute, pour un une évaluation plus précise et des conseils adaptés sur la santé et le poids.

source: Your BMI is {}. Your BMI indicates that you are obese. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way and reduce health risks. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
es: Tu IMC es {}. Tu IMC indica que tienes obesidad. Es importante consultar a un doctor o nutricionista para evaluar tu salud e identificar formas de perder peso de manera sana y reducir riesgos de salud.. Observación: Para una interpretación adecuada del IMC, se recomienda considerar otros factores como la composición del organismo, distribución de grasa, edad, género y salud general de la persona. Siempre es recomendable consultar a un sanitario profesional, como un nutricionista o un fisioterapeuta, para una evaluación más precisa y consejos adecuados sobre salud y peso.
fr: Votre IMC est {}. Votre IMC indique que vous êtes obèse. Il est important de consulter un médecin ou un nutritionniste pour évaluer votre santé et identifier les moyens de perdre du poids de manière saine et de réduire les risques pour la santé. Remarque : Pour une interprétation adéquate de l'IMC, il est recommandé de considérer d'autres facteurs tels que la composition de l'organisme, la distribution de graisse, âge, sexe et état de santé général de la personne. Il est toujours conseillé de consulter un professionnel de la santé, comme un nutritionniste ou un physiothérapeute, pour un une évaluation plus précise et des conseils adaptés sur la santé et le poids.

source: Attention
es: Atención

source: Calculate your BMI
es: Calcular tu IMC
fr: Calculer votre IMC

source: This addon calculates the body mass index.
es: Este complemento calcula el índice de masa corporal.
fr: Cette extension calcule l'indice de masse corporelle.
